package ui

import "time"

type emote struct {
	ID       string
	Number   int
	Name     string
	Frames   []string
	Duration time.Duration
}

const pixelHandLeft = "\x1b[38;2;255;203;35m▀\x1b[38;2;255;203;35;48;2;238;167;0m▀\x1b[38;2;255;203;35m▄\x1b[38;2;255;203;35m▄\x1b[38;2;238;167;0m▄\x1b[38;2;255;203;35;48;2;238;167;0m▀  \x1b[0m\n  \x1b[38;2;238;167;0m▀\x1b[38;2;255;203;35;48;2;255;203;35m▀\x1b[38;2;255;180;0;48;2;255;180;0m▀\x1b[38;2;236;164;0;48;2;255;206;38m▀\x1b[38;2;255;203;35;48;2;255;180;0m▀\x1b[38;2;255;203;35;48;2;255;180;0m▀\x1b[0m\n    \x1b[38;2;238;167;0m▀\x1b[38;2;255;180;0;48;2;255;203;35m▀\x1b[38;2;255;203;35;48;2;255;203;35m▀\x1b[38;2;255;203;35;48;2;255;177;0m▀\x1b[0m\n     \x1b[38;2;255;203;35m▄\x1b[38;2;255;203;35m▀ \x1b[0m"
const pixelHandRight = "  \x1b[38;2;255;203;35;48;2;238;167;0m▀\x1b[38;2;238;167;0m▄\x1b[38;2;255;203;35m▄\x1b[38;2;255;203;35m▄\x1b[38;2;255;203;35;48;2;238;167;0m▀\x1b[38;2;255;203;35m▀\x1b[0m\n\x1b[38;2;255;203;35m▀\x1b[38;2;255;203;35;48;2;255;180;0m▀\x1b[38;2;243;176;9;48;2;255;208;40m▀\x1b[38;2;255;180;0;48;2;255;180;0m▀\x1b[38;2;255;203;35;48;2;255;203;35m▀\x1b[38;2;238;167;0m▀  \x1b[0m\n\x1b[38;2;255;203;35;48;2;255;176;0m▀\x1b[38;2;255;203;35;48;2;255;203;35m▀\x1b[38;2;255;180;0;48;2;255;203;35m▀\x1b[38;2;238;167;0m▀    \x1b[0m\n \x1b[38;2;255;203;35m▀\x1b[38;2;255;203;35m▄     \x1b[0m"

func emoteByID(id string) (emote, bool) {
	for _, item := range emoteCatalog {
		if item.ID == id {
			return item, true
		}
	}
	return emote{}, false
}

func emoteByNumber(n int) (emote, bool) {
	for _, item := range emoteCatalog {
		if item.Number == n {
			return item, true
		}
	}
	return emote{}, false
}
